import React from 'react';
import Page from 'src/components/Page';
import { useTranslation } from 'react-i18next';
import { useTheme, makeStyles } from '@material-ui/core/styles';
import { Container, Box, Typography } from '@material-ui/core';
import Accordion from '@material-ui/core/Accordion';
import AccordionSummary from '@material-ui/core/AccordionSummary';
import AccordionDetails from '@material-ui/core/AccordionDetails';
import ExpandMoreIcon from '@material-ui/icons/ExpandMore';
// ----------------------------------------------------------------------

const useStyles = makeStyles((theme) => ({
  root: {
    display: 'flex',
    minHeight: '100%',
    alignItems: 'center',
    padding: theme.spacing(13, 0, 4)
  },
  heading: {
    color: theme.palette.secondary.main,
    lineHeight: 1,
    marginRight: '0.5rem'
  },
  orderedList:{
    paddingLeft:theme.spacing(5),
    "& li": {
      marginBottom: theme.spacing(2),
    }

  },
  list:{
    listStyle:"outside",
    paddingLeft:theme.spacing(2),
    marginTop: theme.spacing(2),
    "& li": {
      marginBottom: theme.spacing(2),
    }
  }
}));

// ----------------------------------------------------------------------

function RegisterForm({ formik }) {
  const classes = useStyles();
  const { t } = useTranslation();

  return (
    <Page className={classes.root}>
      <Container maxWidth="lg">
        <Box>
          <Typography variant="h3" gutterBottom className={classes.heading}>
            اتفاقية الاستخدام
          </Typography>
          <Typography variant="body1" sx={{ mb:5, mt: 3}}>
            منصة تجار قطع غيار السيارات QVM المملوكة لشركة كيو بارتز القابضة
            المحدودة والمسجلة في سوق أبوظبي العالمي بموجب رخصة تجارية رقم:
            000003490 والتي تمثلها في المملكة العربية السعودية شركة تطبيق قطع
            للتجارة ذات السجل التجاري رقم: 2050117731 ترحّب بكم ، وتبلغكم بأنكم
            سوف تجدون أدناه الشروط والأحكام المُنظّمة لاستخدامكم لمنصة QVM وكافة
            الآثار القانونية التي تنتج عن استخدامكم لخدمات منصة QVM في الشبكة
            العنكبوتية ، حيث أن استخدام أي شخصٍ كان لمنصة QVM سواءً كان مستهلكاً
            أو تاجراً أو غير ذلك فإن هذا يُعد موافقة وقبول منه وهو بكامل أهليته
            المعتبرة شرعاً ونظاماً وقانوناً لكافة مواد وبنود وأحكام هذه
            الاتفاقية وهو تأكيد لالتزامكم بأنظمتها ولما ذُكر فيها، ونشير إليكم
            بأن منصة QVM قد تكون عبارة عن ( موقع إلكتروني أو تطبيق على الهواتف
            المحمولة أو منصة إلكترونية ) وتعتبر هذه الاتفاقية سارية المفعول
            ونافذة بمجرد قيامكم بالموافقة عليها والبدء في التسجيل بمنصة QVM
            بموجب المادتين الخامسة والعاشرة من نظام التعاملات الالكترونية
            السعودي.
          </Typography>
        </Box>
        <Box>
        <Accordion>
          <AccordionSummary
            expandIcon={<ExpandMoreIcon />}
            aria-controls="panel1a-content"
            id="panel1a-header"
          >
            <Typography className={classes.heading}>المادة الأولى – المقدّمة و التعريفات:</Typography>
          </AccordionSummary>
          <AccordionDetails>
            <Typography sx={{mb:2}}>
              يعتبر التمهيد أعلاه جزءاً لا يتجزأ من هذه الاتفاقية ، كما تجدون أدناه الدلالات والتعريفات للعبارات الرئيسية المستخدمة في هذه الاتفاقية :
            </Typography>
            <ol className={classes.orderedList}>
                                    <li>
                                        ( منصة QVM المملوكة لشركة كيو بارتز القابضة المحدودة) يقصَد بهذه العبارة شركة تطبيق قطع للتجارة، ويشمل هذا التعريف كافة أشكال شركة تطبيق قطع للتجارة على الشبكة العنكبوتية، سواءً كانت تطبيق إلكتروني، أو موقع الكتروني على الشبكة العنكبوتية.
                                    </li>
                                    <li>
                                        ( التاجر أو المستخدم) يقصَد بهذه العبارة كل تاجر يسجّل في منصة QVM سواء كان مورد ورفع مخزونه في النظام أو سواءً كان مستخدم للنظام أو المنصة، ويشمل هذا التعريف كافة أوجه المنصة طالما أنه يقوم بتجارته عن طريق منصة QVM، ويشمل ذلك الموقع الالكتروني للتاجر.
                                    </li>
                                    <li>
                                        ( المنصة أو النظام) يقصَد بهذه العبارة المنصة المستخدَم من قبل التاجر في نظام QVM الإلكتروني.
                                    </li>
                                    <li>
                                        ( الاتفاقية ) يقصَد بهذه العبارة قواعد وشروط وأحكام استخدام منصة QVM الإلكترونية، أي كافة أحكام وشروط هذه الاتفاقية، والتي تحكم وتنظّم العلاقة فيما بين أطراف هذه الاتفاقية.
                                    </li>
                                    <li>
                                        ( مزود الخدمة ) يقصَد بهذه العبارة الخدمات التي تقوم منصة QVM بتوفيرها للتُجّار عن طريق أطراف ثالثة ، ويُقصد بـ توفير الخدمات أي مجرد توفير الربط بين التاجر ومزود الخدمة ، حيث أنه لا سلطان ولا علاقة لمنصة QVM بالاتفاق المبرم بين التاجر ومزود الخدمة .

                                    </li>
                                </ol>
          </AccordionDetails>
        </Accordion>
        <Accordion>
          <AccordionSummary
            expandIcon={<ExpandMoreIcon />}
            aria-controls="panel2a-content"
            id="panel2a-header"
          >
            <Typography className={classes.heading}>المادة الثانية – أهلية التاجر القانونية:</Typography>
          </AccordionSummary>
          <AccordionDetails>
          <ol className={classes.orderedList}>
                                    <li>
                                        يقر التاجر بأنه ذا أهلية قانونية معتبرة شرعاً وقانوناً، وأن عمره لا يقل عن ثمانية عشرة عاماً، كما هو معتبر في القوانين والأنظمة المرعية بالمملكة العربية السعودية ، وأنه ذا دراية كافية لاستخدام ورفع مخزونه عبر منصة QVM.
                                    </li>
                                    <li>
                                        يقر التاجر بأنه ذا أهلية سليمة وأنه غير مصاب بأي عارض من عوارض الأهلية.
                                    </li>
                                    <li>
                                        في حال قيام التاجر بالتسجيل كمؤسسة أو شركة، أو أي شكل نظامي آخر، فإن هذه المؤسسة أو الشركة أو الشكل النظامي المسجّل عن طريقه يجب أن تتوافر فيه الأهلية القانونية والنظامية والشرعية اللازمة للقيام بأعمال التجارة عبر منصة QVM الالكترونية.
                                    </li>
                                    <li>
                                        يوافق التاجر بأنه في حال مخالفته لهذه المادة ” أهلية التاجر القانونية ” فإنه يتحمّل تبعات هذه المخالفة أمام المستخدمين أو المستخدمين أو الغير، حيث أن منصة QVM لا علاقة لها بتعاملات التاجر مع المستخدم أو الغير من الناحية القانونية والنظامية والشرعية، كما أنه يحق لمنصة QVM في هذه الحالة مساءلة التاجر بموجب أحكام المسئولية العقدية، ومطالبته بالتعويض عن الأضرار التي قد تنشأ نتيجة هذه المخالفة، ومن قبيل هذه الأضرار ما يصيب منصة QVM في سمعتها أمام التجار الآخرين أو المستخدمين أو المستخدمين أو أمام الغير.
                                    </li>
                                </ol>
          </AccordionDetails>
        </Accordion>
        
        <Accordion>
          <AccordionSummary
            expandIcon={<ExpandMoreIcon />}
            aria-controls="panel3a-content"
            id="panel3a-header"
          >
            <Typography className={classes.heading}>
            المادة الثالثة – طبيعة التزام منصة QVM:
            </Typography>
          </AccordionSummary>
          <AccordionDetails>
           <ol className={classes.orderedList}>
                                    <li>
                                        إن مهمة منصة QVM هي مجرد تقديم أدوات الدعم الالكتروني، عن طريق توفير المنصة، حيث أن التزام منصة QVM بموجب هذه الاتفاقية هو فقط توفير المنصة الإلكترونية للتاجر واستخدامه بالخيارات الموجودة فيها.
                                    </li>
                                    <li>
                                        قد توفّر منصة QVM خدمات أخرى للتاجر أو المنصة كخدمات الدعم التسويقي أو خدمات التوجيه والإرشاد، وكذلك قد توفّر له بوابات دفع الكترونية عبر الانترنت، وجميع خدمات منصة QVM تخضع لمواد وبنود وأحكام اتفاقية الاستخدام هذه.
                                    </li>
                                    <li>
                                        لا تلتزم منصة QVM بإتمام عمليات بيع المنتجات أو الخدمات بين المستخدم والمنصة، حيث أن التزامها ينتهي بتقديم خدمات النظام الالكتروني عبر منصة QVM، ولا يضر ذلك بالخدمات الأخرى التي تستمر منصة QVM بتقديمها، كخدمات التوجيه والإرشاد والدعم الفني والتسويق ووسائل الدفع، وقد تتدخل المنصة في المبيعات في حال تم توفير خاصية الشراء والبيع عن طريق المنصة.
                                    </li>
                                    <li>
                                        إن جميع التعاملات التي تتم بين التاجر والمستخدم لا علاقة لها بشخص منصة QVM، ومنصة QVM غير مسئولة عنها، حيث أن هذا التعامل هو علاقة تعاقدية مستقلة تخضع للاتفاق الذي يبرم بين التاجر والمستخدم. وبناءً عليه فإذا تخلّف المستخدم عن سداد ثمن الخدمة أو المنتج الذي يوفّره التاجر فلا علاقة لمنصة QVM بهذه المخالفات، وقد تتدخل المنصة في المبيعات في حال تم توفير خاصية الشراء والبيع عن طريق المنصة.
                                    </li>
                                    <li>
                                        إن جميع التعاملات التي تتم بين التاجر ومزودي الخدمات ( خدمات الطرف الثالث ) الذين توفر منصة QVM الربط مع خدماتهم أو عرض خدماتهم ليستفيد منها التاجر والمستخدم لا علاقة لها بمنصة QVM، حيث أن هذا التعامل هو علاقة تعاقدية مستقلة عن منصة QVM وخاضعة للاتفاق المبرم بين التاجر ومزود الخدمة ، وبناءً عليه فإذا تخلّف أو امتنع أو لم يلتزم أحد الاطراف في تنفيذ التزاماته التي جرى الاتفاق عليها أو لم ينفذها على الوجه المطلوب فإن منصة QVM غير مسئولة عن ما ينتج عن هذه التصرفات ، إن منصة QVM غير مسئولة عن أي مخالفات تحدث أو يتم ارتكابها بين التاجر ومزود الخدمة.
                                    </li>
                                    <li>
                                        أنت تعلم أن منصة QVM تعتبر منصة إلكترونية تقنية على شبكة الانترنت تتيح للتاجر الذي يوافق على هذه الاتفاقية الاستفادة من خدمات المنصة والتعامل مع تجار ومستخدمين من نفس المجال ، والقدرة على رفع المخزون عبر المنصة ، وممارسة البيع والشراء عن طريق المنصة، ومهمتها تنتهي عند هذا الحد. فليس هناك أدنى مسئولية على منصة QVM حول المخالفات التي يقوم بها التاجر لأحكام هذه الاتفاقية، وليس لمنصة QVM أي علاقة بالنسبة للتعاملات التي تتم بين التاجر والمستخدم.
                                    </li>
                                </ol>
          </AccordionDetails>
        </Accordion>
        <Accordion>
          <AccordionSummary
            expandIcon={<ExpandMoreIcon />}
            aria-controls="panel4a-content"
            id="panel4a-header"
          >
            <Typography className={classes.heading}>
            المادة الرابعة – ضوابط التعامل مع المنصة الالكترونية:
            </Typography>
          </AccordionSummary>
          <AccordionDetails>
           <ol className={classes.orderedList}>
                                    <li>
                                        يجوز لكل شخص توافرت فيه الأهلية القانونية المعتبرة نظاماً وشرعاً استخدام النظام وفقاً لقواعد وأحكام اتفاقية الاستخدام وعلى وجه الخصوص ” المادة الأولى – أهلية التاجر القانونية.
                                    </li>
                                    <li>
                                        يجوز للتاجر أ المستخدم أن يقوم برفع مخزونه في النظام أو يقوم بالربط المباشر.
                                    </li>
                                    <li>
                                        يجب أن يكون المخزون المرفوع أو الذي تم ربطه مع مخزون التاجر أو المستخدمعلى منصة QVM غير مخالف لقواعد وأحكام اتفاقية الاستخدام هذه ، كما يقر التاجر بأن المعلومات التي رفعها صحيحة من توافر وأسعار قطع.
                                    </li>
                                    <li>
                                        لا يحق لأي شخص استخدام منصة QVM إذا ألغيت عضويته من قبل منصة QVM أو بموجب أوامر أو أحكام قضائية.
                                    </li>
                                    <li>
                                        في حال قيام أي مستخدم بالتسجيل كمؤسسة أو شركة، أو مؤسسة خيرية أو جهة اعتبارية، فإن المؤسسة أو الشركة أو الجهة المسجّلة تكون ملزمة بكافة القواعد والأحكام المذكورة في اتفاقية الاستخدام الخاصة بمنصة QVM.
                                    </li>
                                    <li>
                                        ينبغي على كافة المستخدمين والتُجّار الالتزام بكافة القوانين المعمول بها لتنظيم التجارة عبر الانترنت وكذلك الالتزام بنظام الجرائم المعلوماتية وأنظمة وزارة التجارة والاستثمار ونظام التعاملات الإلكترونية ونظام التجارة الإلكترونية.
                                    </li>
                                    <li>
                                        يقر التاجر بأنه قبل تسجيله في منصة QVM الالكترونية قد تحقق من توافر جميع الإجراءات والاشتراطات المطلوبة من قبل الجهات الرسمية في المملكة العربية السعودية وقد استوفى جميع هذه الإجراءات والاشتراطات لممارسة نشاطه في المنصة.
                                    </li>
                                    <li>
                                        في حالة كان التاجر المتقدّم لطلب الانضمام وتأسيس المنصة عبارة عن تاجر فرد “شخص طبيعي”، فيلتزم كذلك بالتحقق من الاشتراطات المطلوبة لدى الجهات الرسمية وتوفيرها بحسب طبيعة نشاط الفرد التاجر، حيث أن التاجر الفرد يقر بأنه ملتزم بهذه الاشتراطات وملتزم بتوفيرها وتجهيزها، كما يلتزم التاجر الفرد بتوفير رقم هويته الوطنية وغير ذلك من المعلومات اللازمة والوثائق التي تطلبها منصة QVM.
                                    </li>
                                    <li>
                                        في حالة كان التاجر المتقدم لطلب الانضمام وتأسيس متجره يمثل مؤسسة تجارية أو شركة أو مؤسسة خيرية أو جهة اعتبارية فلابُد من تزويد منصة QVM بكافة المعلومات والوثائق الثبوتية، مثل السجل التجاري وأي وثائق أخرى للمتجر تطلبها منصة QVM للتسجيل ولإثبات الشخصية القانونية الخاصة بالمنصة.
                                    </li>
                                    <li>
                                        يجب أن يلتزم المنصة والتاجر بالتزامات التسجيل المحددة في ” المادة الخامسة – الحسابات والتزامات التسجيل “، وجميع قواعد وأحكام اتفاقية الاستخدام.
                                    </li>
                                </ol>
          </AccordionDetails>
        </Accordion>
        <Accordion>
          <AccordionSummary
            expandIcon={<ExpandMoreIcon />}
            aria-controls="panel5a-content"
            id="panel5a-header"
          >
            <Typography className={classes.heading}>
            المادة الخامسة – الحسابات والتزامات التسجيل:
            </Typography>
          </AccordionSummary>
          <AccordionDetails>
           <ol className={classes.orderedList}>
                                    <li>
                                        فور التقدم بطلب الانضمام إلى عضوية منصة QVM تكون مطالباً بالإفصاح عن معلومات محددة واختيار اسم مستخدم وكلمة مرور سرية لاستعمالها عند الولوج لخدمات منصة QVM. وبعد تنشيط حسابك سوف تصبح مستخدمًا لخدمات منصة QVM ، وبذلك تكون قد وافقت على:
                                        <ul className={classes.list}>
                                            <li>
                                                أن تكون مسؤولاً عن المحافظة على سرية معلومات حسابك وسرية كلمة المرور ، وتكون بذلك موافقاً على إعلام منصة QVM حالاً بأي استخدام غير مفوض به لمعلومات حسابك لدى منصة QVM أو أي اختراق آخر لمعلوماتك السرية.
                                            </li>
                                            <li>
                                                لن تكون منصة QVM بأي حال من الأحوال مسؤولًة عن أي خسارة قد تلحق بك بشكل مباشر أو غير مباشر معنوية أو مادية نتيجة كشف معلومات إسم المستخدم أو كلمة الدخول أو في حال إساءة استخدام المنصة.
                                            </li>
                                            <li>
                                                أنت تلتزم باستخدام متجرك الالكتروني بنفسك، حيث أنك مسؤولاً عنه مسؤولية كاملة، وفي حال استخدام غيرك له فهذه يعني أنك قد فوّضته باستخدام المنصة باسمك ولحسابك مالم يقوم المنصة بإبلاغ إدارة QVM بعكس ذلك.
                                            </li>
                                            <li>
                                                أنت تلتزم عند استخدام منصة QVM أن تستخدمها بكل جدية ومصداقية، وأن تلتزم بقواعد وأحكام اتفاقية الاستخدام وأن تلتزم بالضوابط النظامية والقانونية المعمول بها في المملكة العربية السعودية، وتعتبر ملزماً بتعويض منصة QVM عن أي خسائر مباشرة أو غير مباشرة قد تلحق بمنصة QVM نتيجة أي استخدام غير شرعي أو غير حقيقي أو غير مفوض لحسابك من طرفك أو من طرف أي شخص آخر حصل على مفاتيح الولوج إلى حسابك بالمنصة سواء كان لإنجاز الخدمات باستعمال اسم المستخدم وكلمة المرور أو نتيجة لإهمالك المحافظة على سرية اسم المستخدم وكلمة المرور، أو استخدام النظام بغرض المنافسة ، وسواء بتفويض منك أو بلا تفويض.
                                            </li>
                                            <li>
                                                أنت تلتزم بالإفصاح عن معلومات حقيقية وصحيحة و محدثة و كاملة وقانونية عن نفسك حسبما هو مطلوب أثناء التسجيل لدى منصة QVM وتلتزم بتحديث بياناتك في حال تغييرها في الواقع أو في حال الحاجة إلى ذلك.
                                            </li>
                                            <li>
                                                أن لا تدرج ضمن اسم المستخدم أي من تفاصيل الاتصال بك كعناوين البريد الإلكتروني أو أرقام هواتفك أو أي تفاصيل شخصية، أو أي عبارة تُشير إلى علاقة شخصية أو تجارية بينك وبين منصة QVM أو منسوبيها أو مُلّاكها.
                                            </li>
                                            <li>
                                                إن منصة QVM تلتزم بالتعامل مع معلوماتك الشخصية وعناوين الاتصال بك بسريّة وفقاً لأحكام سياسة الخصوصية وسرية المعلومات المعمول بها لدى منصة QVM.
                                            </li>
                                            <li>
                                                سوف تكون ملزمًا بالحفاظ على بيانات التسجيل وتحديثها دائمًا للإبقاء عليها حقيقية وصحيحة وراهنة وكاملة وقانونية، وإذا أفصحت عن معلومات غير حقيقية أو غير صحيحة أو غير راهنة أو غير كاملة أو غير قانونية او مخالفة لما جاء في اتفاقية الاستخدام، فإن منصة QVM تمتلك الحق في وقف أو تجميد أو إلغاء عضويتك أو متجرك وحسابك في المنصة، وذلك دون إلحاق الأضرار بحقوق منصة QVM الأخرى ووسائلها المشروعة في استرداد حقوقها وحماية باقي المستخدمين.
                                            </li>
                                        </ul>
                                    </li>
                                    <li>
                                        لمنصة QVM الحق في أي وقت في أن تجري أي تحقيقات تراها ضرورية سواء كانت مباشرة أو عبر طرف ثالث وتطالبك بالإفصاح عن أي معلومات إضافية أو وثائق مهما كان حجمها لإثبات هويتك أو ملكيتك لأموالك أو للحساب الخاص بك.
                                    </li>
                                    <li>
                                        في حالة عدم الالتزام بأي مما ورد أعلاه فإن لإدارة منصة QVM الحق في إيقاف أو إلغاء متجرك أو عضويتك أو حجبك من الولوج لخدمات منصة QVM مرة أخرى. وتحتفظ كذلك بالحق في إلغاء أي حسابات غير مؤكدة وغير مثبتة أو عمليات أو حسابات مر عليها مدة طويلة دون نشاط.
                                    </li>
                                </ol>
          </AccordionDetails>
        </Accordion>
        <Accordion>
          <AccordionSummary
            expandIcon={<ExpandMoreIcon />}
            aria-controls="panel6a-content"
            id="panel6a-header"
          >
            <Typography className={classes.heading}>
            المادة السادسة – الاتصالات الإلكترونية ووسائل التواصل الرسمية:
            </Typography>
          </AccordionSummary>
          <AccordionDetails>
           <ol className={classes.orderedList}>
                                    <li>
                                        يوافق التاجر في منصة QVM على أن يتم التواصل معه عبر البريد الإلكتروني أو الهاتف الجوال، أو من خلال قيام إدارة منصة QVM ببث رسائل عامة ترد إلى كافة المستخدمين أو إلى مستخدمين محددين حال الولوج إلى حساباتهم داخل منصة QVM. كما يوافق التاجر في منصة QVM على أن جميع الاتفاقيات والإعلانات والبيانات والاتصالات الأخرى التي تزود بها الكترونياً تقوم مقام مثيلاتها المكتوبة ، وهي حجة قائمة بذاتها ، في تلبية الاحتياجات القانونية.
                                    </li>
                                    <li>
                                        سوف تقوم منصة QVM خلال فترة عضويتك وتجارتك لدى المنصة بإرسال رسائل إلكترونية ترويجية لتعريفك بأي تغيرات أو إجراءات أو نشاطات دعائية جديدة قد تضاف إلى منصة QVM.
                                    </li>
                                </ol>
          </AccordionDetails>
        </Accordion>
        <Accordion>
          <AccordionSummary
            expandIcon={<ExpandMoreIcon />}
            aria-controls="panel7a-content"
            id="panel7a-header"
          >
            <Typography className={classes.heading}>
            المادة السابعة – التعديلات على اتفاقية الاستخدام والرسوم:
            </Typography>
          </AccordionSummary>
          <AccordionDetails>
           <ol className={classes.orderedList}>
                                    <li>
                                        أنت تعلم وتوافق على أن تقوم منصة QVM بإعلامك عن أي تعديل على هذه الاتفاقية، وبموجبه تتضاعف التزاماتك أو تتضاءل حقوقك وفقاً لأي تعديلات قد تجري على اتفاقية الاستخدام هذه.
                                    </li>
                                    <li>
                                        أنت توافق على أن منصة QVM تملك بمطلق صلاحيتها ودون تحملها المسؤولية القانونية أن تجري أي تعديلات أساسية أو فرعية على هذه الاتفاقية، ويتم إعلام المستخدمين عن هذا التعديل بأي وسيلة تقنية يتم توفيرها، ويجوز أن يكون ذلك عن طريق البريد الإلكتروني أو ببث رسالة عامة لكافة المستخدمين، وتوفّر منصة QVM وسائل تقنية لإظهار قبول المنصة لهذا التعديل، ويكون هذا القبول قانوني ونافي للجهالة ومُلزِم للمتجر لأحكام الاتفاقية بما فيها من تعديلات.
                                    </li>
                                    <li>
                                        في حال الاعتراض على أي تعديل على اتفاقية الاستخدام فإن ذلك قد يكون عقبة أمام الولوج إلى المنصة، حيث أنه للاستفادة من خدمات منصة QVM يجب الموافقة على هذه الاتفاقية وعلى أي تعديل يطرأ عليها، ولذلك في حالة عدم قبول التعديل تأمل منكم منصة QVM التوقف عن استخدام خدماتها حيث أن مجرد ولوجكم إلى حسابكم في منصة QVM أو استخدامكم لمنصة QVM يُعد قبولًا منكم للتعديلات وموافقة كاملة تامة نافية للجهالة، وتسعد منصة QVM الإجابة على استفساراتكم بشأن هذه الاتفاقية واستقبال أي اقتراحات يراها المنصة.
                                    </li>
                                    <li>
                                        كافة الرسوم تحتسب بالريال السعودي في داخل المملكة العربية السعودية، وبعملة البلد في حال التسجيل خارج المملكة، وعلى التاجر دفع كافة الرسوم المستحقة بالمنصة مضافاً إليها أي نفقات أخرى تضيفها منصة QVM، على أن يتم السداد بواسطة الوسائل المعتمدة والمحددة والمتاحة عن طريق منصة QVM.
                                    </li>
                                    <li>
                                        ليست كل باقات وعروض منصة QVM مجانية للتُجّار وللمستخدمين حيث أن بعض هذه الباقات والعروض تخضع لرسوم متفاوتة.
                                    </li>
                                    <li>
                                        قد تفرض منصة QVM رسومًا على بعض التُجّار أو المستخدمين وذلك يعتمد على العروض أو الباقات التي ينضمون إليها.
                                    </li>
                                    <li>
                                        تحتفظ منصة QVM بحقها في إضافة أو زيادة أو خفض أو خصم أي رسوم أو نفقات بموجب قواعد وأحكام اتفاقية الاستخدام ، على أي من المستخدمين أي كان سبب تسجيلهم.
                                    </li>
                                </ol>
          </AccordionDetails>
        </Accordion>
        <Accordion>
          <AccordionSummary
            expandIcon={<ExpandMoreIcon />}
            aria-controls="panel8a-content"
            id="panel8a-header"
          >
            <Typography className={classes.heading}>
            المادة الثامنة – خدمات الدفع والسداد للمتاجر في منصة QVM:
            </Typography>
          </AccordionSummary>
          <AccordionDetails>
           <ol className={classes.orderedList}>
                                    <li>
                                        توفّر منصة QVM عبر شركائها نظام الدفع والسداد في منصة QVM فيمكن أن يتم عبر الانترنت كليا من خلال خيارات الدفع المتوفرة على منصة QVM أو من خلال أي طريقة دفع توفرها منصة QVM من حين لآخر.
                                    </li>
                                    <li>
                                        ليس هناك أي علاقة لمنصة QVM بطريقة الدفع عند الاستلام، فطريقة الدفع هذه تخضع للعلاقة فيما بين المستخدم والتاجر ومزود الخدمة.
                                    </li>
                                    <li>
                                        يجوز أن تشترط منصة QVM في أي وقت وأي حالٍ من الأحوال أن تتم عمليات الدفع مباشرةً بين التاجر والمستخدم، وعبر حساباتهم البنكية الخاصة بهم، وليس هناك أي علاقة حينئذٍ لمنصة QVM أو عن طريقها، ولكن لا تتحمل QVM أي التزامات في ما يتم خارج المنصة.
                                    </li>
                                    <li>
                                        إن توفير منصة QVM لخدمة الدفع عبر الانترنت عن طريق المنصة هو بغرض التسهيل والمحافظة على حقوق التجار والمستخدمين.
                                    </li>
                                    <li>
                                        يلتزم التاجر ومزود الخدمة بتحديد سعر الخدمة أو البضاعة التي يقوم بعرضها في المنصة وفقاً للقيمة السوقية المتعارف عليها، ولا علاقة لمنصة QVM بأي حال من الأحوال بسوء تقدير تكلفة المنتجات أو الخدمات المعروضة في المتاجر على منصة QVM، حيث أن تقديرها بالشكل المتعارف عليه تجارياً هو التزاماً واقع على عاتق التاجر.
                                    </li>
                                    <li>
                                        يلتزم التاجر بتوفير فواتير وسندات قبض وسندات استلام لجميع المبالغ والأرباح التي تنشأ في عملياته ويلتزم أن يبيّن في جميع هذه الفواتير نوع البضاعة أو الخدمة وكمياتها وأوصافها وقيمتها، وعليه فإن التاجر يلتزم بتوفير المواصفات المحاسبية المطلوبة في منتجاته. تطبيقاً لأحكام هذه الاتفاقية، ولما في هذا التنظيم من مصالح قانونية واقتصادية وتجارية للتجار، وفي حالة مخالفة التاجر أو المستخدم لأحكام هذا البند فإنه يُعَد مسئولاً عن أي أضرار قد تنشأ نتيجة هذه المخالفة.
                                    </li>
                                    <li>
                                        منصة QVM لها الحق في منع استكمال إجراءات أي عملية دفع مخالفة لقواعد وأحكام اتفاقية الاستخدام أو إلغاء أي طلب شراء أو بيع نتيجة خطأ فني أو تقني في المنصة أدى إلى اختلاف الأسعار المعروضة على المنصة عن قيمة المنتج السوقية بما فيه خسارة لمنصة QVM ولا تتحمل منصة QVM مسئولية تلك المبالغ.
                                    </li>
                                    <li>
                                        لإدارة منصة QVM الحق في إلغاء أو تعديل أو تغيير أي من وسائل الدفع التي قامت بإتاحتها على منصة QVM.
                                    </li>
                                </ol>
          </AccordionDetails>
        </Accordion>
        <Accordion>
          <AccordionSummary
            expandIcon={<ExpandMoreIcon />}
            aria-controls="panel9a-content"
            id="panel9a-header"
          >
            <Typography className={classes.heading}>
            المادة التاسعة – معلوماتك الشخصية ومعلومات تفاصيل العمليات:
            </Typography>
          </AccordionSummary>
          <AccordionDetails>
           <ol className={classes.orderedList}>
                                    <li>
                                        لا مانع لديك بأن تمنح منصة QVM حقاً غير محدود، وعالمي، ودائم وغير قابل للإلغاء، ومعفي من المصاريف، و مرخص باستخدام معلومات أو مواد شخصية أو غير ذلك مما وفرتها أو زودت بها المنصة أو أعلنتها على المنصة من خلال انضمامك إليها أو تأسيسك لمتجرك، وذلك عبر النماذج المخصصة للتواصل و التسجيل، أو عبر أية رسالة إلكترونية أو أي من قنوات الاتصال المتاحة بالمنصة. وذلك بهدف تحقيق أي من المصالح التي تراها المنصة.
                                    </li>
                                    <li>
                                        أنت الوحيد المسؤول عن المعلومات التي قمت بإرسالها أو نشرها وينحصر دور منصة QVM بالسماح لك بعرض هذه المعلومات عن طريق منصة QVM ومن خلال قنواتها الإعلانية.
                                    </li>
                                    <li>
                                        تخضع سرية معلومات المتاجر والتجار لقواعد “سياسة الخصوصية وسرية المعلومات” الخاصة بمنصة QVM.
                                    </li>
                                </ol>
          </AccordionDetails>
        </Accordion>
        <Accordion>
          <AccordionSummary
            expandIcon={<ExpandMoreIcon />}
            aria-controls="panel0a-content"
            id="panel0a-header"
          >
            <Typography className={classes.heading}>
            المادة العاشرة – تعهد التاجر بـالالتزام بالقوانين والأنظمة في المملكة العربية السعودية :
            </Typography>
          </AccordionSummary>
          <AccordionDetails>
           <ol className={classes.orderedList}>
                                    <li>
                                        يتعهّد التاجر بالالتزام بكافة القوانين والأنظمة المعمول بها داخل المملكة العربية السعودية حيال منتجاته أو/و أثناء استخدامه لمنصة QVM، وكذا القوانين والشروط والأحكام المعمول بها والمُنظِّمة لاستخدام فضاء الإنترنت.
                                    </li>
                                </ol>
          </AccordionDetails>
        </Accordion>
        <Accordion>
          <AccordionSummary
            expandIcon={<ExpandMoreIcon />}
            aria-controls="panel11a-content"
            id="panel11a-header"
          >
            <Typography className={classes.heading}>
            المادة الحادية عشرة – الحقوق:
            </Typography>
          </AccordionSummary>
          <AccordionDetails>
           <ol className={classes.orderedList}>
                                    <li>
                                        كافة المحتويات المتواجدة على منصة QVM، إلكترونية كانت أو غير ذلك، مكتوبة أو غير مكتوبة، على سبيل المثال لا الحصر: النصوص المكتوبة وغير المكتوبة – التصاميم الجرافيكية – الأفكار التقنية – الشعارات – العروض – أيقونات الأزرار – الرموز – المقاطع الصوتية – البيانات المجمّعة والبرامج الإلكترونية ، هي ملك لمنصة QVM وحقوقها محفوظة لمنصة QVM ، ولا يحق لكائنًا من كان أن يستخدمها بأي شكل من الأشكال سواء كان استخدام مباشر أو غير مباشر أو عن طريق طرف ثالث.
                                    </li>
                                    <li>
                                        تُنوه إدارة منصة QVM على أنها سوف تتخذ اللازم حيال التجاوز والتعدي على أي من حقوق منصة QVM أو ملكيتها الفكرية.
                                    </li>
                                    <li>
                                        لا تتحمّل منصة QVM المسؤولية في حال التعدي على حقوق الملكية الفكرية المملوكة للتُجّار الأعضاء في المنصة أو للمتاجر المسجّلة لديها.
                                    </li>
                                </ol>
          </AccordionDetails>
        </Accordion>
        <Accordion>
          <AccordionSummary
            expandIcon={<ExpandMoreIcon />}
            aria-controls="panel12a-content"
            id="panel12a-header"
          >
            <Typography className={classes.heading}>
            المادة الثانية عشرة – الملكية الفكرية:
            </Typography>
          </AccordionSummary>
          <AccordionDetails>
           <ol className={classes.orderedList}>
                                    <li>
                                        تحترم إدارة منصة QVM حقوق الملكية الفكرية الخاصة بالتجار والتي كوّنوها عبر متاجرهم، سواءً كانت مملوكة لهم قبل تأسيس المنصة أم بعد تأسيسه.
                                    </li>
                                    <li>
                                        يحترم التاجر حقوق الملكية الفكرية الخاصة بمنصة QVM، والتي من ضمنها منصة QVM نفسها، والكلمات والشعارات والرموز الأخرى الخاصة بمنصة QVM أو المعروضة على منصة QVM، حيث أن منصة QVM، وكل حق يتبع منصة QVM، هي حقوق محمية بموجب حقوق الملكية الفكرية وقوانين العلامات التجارية وتعد ملكية خالصة لمنصة QVM ولا يحق بأي حال من الأحوال التعدي عليها أو استخدامها دون تفويض من إدارة منصة QVM.
                                    </li>
                                </ol>
          </AccordionDetails>
        </Accordion>
        

        
        <Accordion>
          <AccordionSummary
            expandIcon={<ExpandMoreIcon />}
            aria-controls="panel13a-content"
            id="panel13a-header"
          >
            <Typography className={classes.heading}>
            المادة الثالثة عشرة – حماية المستخدم:
            </Typography>
          </AccordionSummary>
          <AccordionDetails>
           <ol className={classes.orderedList}>
                                    <li>
                                        في حال قام المستخدم بشراء بضاعة بأحد طرق الدفع المتوفرة على منصة QVM، ولم يتسلم بضاعته أو أنه تسلم بضاعة تختلف عن ما عرض من مواصفات ذكرت بصفحة المنصة، حينها يكون من حق المستخدم إبلاغ منصة QVM ولمنصة QVM الحق في اتخاذ ما تراه مناسب حيال التاجر الذي خالف قواعد هذه الاتفاقية، وفقاً لقواعد هذه الاتفاقية. غير أن منصة QVM غير مسئولة قانوناً أو شرعاً عن هذا الإخلال الحاصل من قبل التاجر في مواجهة المستخدم، حيث أنها ليست طرفاً في العلاقة بين المستخدم والتاجر، ولكنها تقوم بذلك لدواعي تحسين جودة منصة QVM والتجار المتواجدين في المنصة.
                                    </li>
                                    <li>
                                        للمستهلك مراجعة مشترياته قبل الاستلام للتأكد من أنها سليمة ومطابقة لما تم شرائه، حيث أن منصة QVM غير مسئولة عن العلاقة التي بين المستخدم والتاجر.
                                    </li>
                                    <li>
                                        إن منصة QVM لا تلتزم بأي حال من الأحوال وفق هذه المادة وهذا البند باتخاذ ردّة فعل تجاه شكوى المستخدم وإنما تخضع ردّة فعل المنصة تجاه شكوى المستخدم إلى محض رغبة منصة QVM ووفق ما تراه المنصة مناسبًا، وفقاً لقواعد هذه الاتفاقية. وبما يحافظ على مصلحتها وسمعتها التجارية والاقتصادية، وعلى كل حال فإن منصة QVM قدّ تتخذ بعض الإجراءات تجاه التجار الذين يتعمّدون خداع أو تظليل أو غش المستخدم ، مثل : تجميد عضوية المنصة أو لفت نظر المنصة إلى عدم تكرار هذا الأمر أو إلزام المنصة بتعويض المستخدم ، وذلك انطلاقًا من رغبة منصة QVM في حفظ وحماية حقوق كافة المستخدمين والمسجّلين لديها.
                                    </li>
                                </ol>
          </AccordionDetails>
        </Accordion>
        <Accordion>
          <AccordionSummary
            expandIcon={<ExpandMoreIcon />}
            aria-controls="panel14a-content"
            id="panel14a-header"
          >
            <Typography className={classes.heading}>
            المادة الرابعة عشرة – مسئولية منصة QVM:
            </Typography>
          </AccordionSummary>
          <AccordionDetails>
           <ol className={classes.orderedList}>
                                    <li>
                                        منصة QVM غير مسؤولة بأي شكل من الأشكال عن أي أداء غير مرض أو متأخر من قبل التجار أو شركات الشحن أو بوابات الدفع الإلكتروني أو البنوك أو عدم التزام المستخدمين بالسداد ، ولا عن أي خسائر ، أو أعطال أو تأخير ، بسبب بضاعة غير متوفرة أو تأخر تسليمها أو عدم جودة الخدمة المقدمة من قبل المتاجر.
                                    </li>
                                    <li>
                                        منصة QVM لا تتحمل أي مطالبات تنشأ عن أخطاء أو إهمال ، سواء كانت ناتجة بشكل مباشر أو غير مباشر أو عرضي أو عن طريق طرف ثالث.
                                    </li>
                                    <li>
                                        منصة QVM لا تتحمل أي مطالبات أو مسئوليات نشأت نتيجة خسائر مالية أو تشويه سمعة أو قذف أو أي أضرار تنشأ نتيجة لسوء استخدام أو إساءة استخدام أو عدم قدرة على استخدام منصة QVM ، إن منصة QVM لا تتحمل أي مسؤوليات أو مطالبات في مثل هذه الحالات.
                                    </li>

                                    <li>
                                        منصة QVM أو مسؤوليها أو منسوبيها أو مُلّاكها غير مسئولين عن أي مطالبة أو نزاع أو تكاليف أو أضرار أو أي مسئولية أو أي خسارة مباشرة أو غير مباشرة لأي طرف نشأت عن فعل قام به أحد المستخدمين للمنصة.
                                    </li>
                                    <li>
                                        منصة QVM ومنسوبيها ومُلّاكها ومن يمثلها ويمثلهم لا علاقة لهم بأي مسئولية تخص منتج سليم و شرعي و مصرح به وفق قوانين وأنظمة المملكة العربية السعودية ويتم استخدامه لأغراض غير شرعية وغير نظامية ، ولا يحق لأي شخص أو جهة الرجوع على منصة QVM بأي دعوى أو مطالبة أو تعويض فيما يخص سوء الاستخدام المذكور، حيث أن جميع المنتجات أو الخدمات المقدّمة في منصة QVM الالكترونية تقدّم عن طريق التجار ومتاجرهم.
                                    </li>
                                    <li>
                                        منصّة QVM ومنسوبيها وملّاكها ومن يمثّلها ويمثّلهم لا علاقة لهم بأي نشاط غير شرعي أو غير نظامي يقوم به المنصة، أو أي نشاط يخالف الأنظمة والتعليمات المرعيّة في المملكة العربية السعودية، حيث تنحصر مسئولية منصة QVM فقط في توفير وتقديم أدوات الدعم الإلكتروني المتمثّل في توفير المنصة الالكترونية وما يتبع ذلك من خدمات دعم إلكتروني.
                                    </li>
                                    <li>
                                        تنوّه إدارة منصة QVM على كافة التجار إلى أنها في حال ملاحظاتها لأي أنشطة مشبوهة يجري التخطيط لارتكابها أو جاري ارتكابها أو جرت على منصة QVM فإنها سوف تتقدّم إلى إبلاغ السلطات المختصة عن هذه الأنشطة . وهي غير مسئولة بأي حال عن هذه المخالفات التي تتم دون علم أو ملاحظة منصة QVM.
                                    </li>
                                </ol>
          </AccordionDetails>
        </Accordion>
        <Accordion>
          <AccordionSummary
            expandIcon={<ExpandMoreIcon />}
            aria-controls="panel15a-content"
            id="panel15a-header"
          >
            <Typography className={classes.heading}>
            المادة الخامسة عشرة – سرية المعلومات:
            </Typography>
          </AccordionSummary>
          <AccordionDetails>
           <ol className={classes.orderedList}>
                                    <li>
                                        تحيطكم منصة QVM علمًا بأن الشبكة العنكبوتية ( فضاء الإنترنت ) ليس وسيلة آمنة ، وسرية المعلومات الشخصية لا يمكن أن تكون مضمونة 100% في فضاء الإنترنت .
                                    </li>
                                    <li>
                                        تتخذ منصة QVM معايير ( ملموسة وتنظيمية وتقنية ) ذات جودة عالية لحماية المستخدمين ومنع وصول شخص غير مفوض إلى معلومات المستخدمين الشخصية أو متاجرهم، وحفظها.
                                    </li>
                                    <li>
                                        منصة QVM ليس لها سيطرة على أفعال أي طرف ثالث ، أو الغير ، مثل صفحات الانترنت الأخرى الموصولة عن طريق روابط إلى المنصة أو أطراف ثالثة تدعي أنها تمثلك وتمثل آخرين.
                                    </li>
                                    <li>
                                        أنت تعلم وتوافق على أن منصة QVM قد تستخدم معلوماتك التي زودتها بها، بهدف تقديم الخدمات لك في منصة QVM، ولإرسال رسائل تسويقية لك ، وان سياسة الخصوصية في منصة QVM تضبط عمليات الجمع والمعالجة والاستخدام والتحويل لمعلومات هويتك الشخصية، وتخضع قواعد سرية المعلومات لـ “سياسة الخصوصية وسرية المعلومات – يوضع الرابط” الخاصة بمنصة QVM.
                                    </li>
                                </ol>
          </AccordionDetails>
        </Accordion>
        <Accordion>
          <AccordionSummary
            expandIcon={<ExpandMoreIcon />}
            aria-controls="panel16a-content"
            id="panel16a-header"
          >
            <Typography className={classes.heading}>
            المادة السادسة عشرة – إلغاء العضوية أو المنصة:
            </Typography>
          </AccordionSummary>
          <AccordionDetails>
              <Typography sx={{mb:2}}>
              إن منصة QVM بحسب اتفاقية الاستخدام وبحسب القوانين والأنظمة المرعية بالمملكة العربية السعودية قد تلجأ إلى وقف مؤقت أو دائم للمتجر أو سحب وإلغاء عضوية التاجر أو تحديد قدرات التجار على الولوج إلى خدمات منصة QVM ، في حالة:
              
              </Typography>
               <ol className={classes.orderedList}>
                                    <li>
                                        انتهاك قواعد وأحكام اتفاقية الاستخدام.
                                    </li>
                                    <li>
                                        إذا لم يكن بإمكان منصة QVM توثيق أي من معلومات المستخدم المقدمة إليها.
                                    </li>
                                    <li>
                                        إذا قررت منصة QVM أن نشاطات المستخدم مخالفة للقانون أو أن نشاطات المستخدم قد تتسبب لمستخدمين آخرين أو لمنصة QVM بمتاعب أو مخالفات قانونية.
                                    </li>
                                    <li>
                                        قد تلجأ منصة QVM “بحسب تقييمها” إلى إعادة نشاط المستخدمين الموقوفين، حيث أن المستخدم الذي أوقف نشاطه نهائياً أو أُلغيت عضويته، قد لا يكون بإمكانه التسجيل أو استعادة حسابه في منصة QVM أو استخدام المنصة بأي طريقة كانت مهما كانت الظروف، لحين السماح له بإعادة نشاطه في منصة QVM من قبل إدارة منصة QVM ومع ذلك فإن المستخدم في حال انتهاكه لاتفاقية الاستخدام هذه فإن منصة QVM تحتفظ بحقها في استعادة أو المطالبة بأي مبالغ مستحقة لمنصة QVM على المستخدم وأي خسائر أو أضرار تسبب بها التاجر لمنصة QVM كما أن لمنصة QVM الحق باتخاذ الإجراءات القانونية أو اللجوء إلى السلطات القضائية في المملكة العربية السعودية ضد المستخدم حسبما تراه منصة QVM مناسباً.
                                    </li>
                                    <li>
                                        إن منصة QVM لا تتنازل عن حقها في اتخاذ الإجراءات المناسبة حيال أي انتهاك يحدث لقواعد وأحكام اتفاقية الاستخدام ولغيرها من أفعال الانتهاك المشابهة ، وكذلك إن منصة QVM لا تلتزم في القيام باتخاذ أي إجراءات ضد أي انتهاك يحدث لاتفاقية الاستخدام وإنما يخضع هذا الأمر لتقدير إدارة منصة QVM وإدارتها القانونية.
                                    </li>
                                </ol>
          </AccordionDetails>
        </Accordion>
        <Accordion>
          <AccordionSummary
            expandIcon={<ExpandMoreIcon />}
            aria-controls="panel17a-content"
            id="panel17a-header"
          >
            <Typography className={classes.heading}>
            المادة السابعة عشرة – عمليات الدفع والبيع والشراء:
            </Typography>
          </AccordionSummary>
          <AccordionDetails>
           <ol className={classes.orderedList}>
                                    <li>
                                        يلتزم التاجر بإدارة مخزونه بشكل جيد ، بما يحافظ على المستخدم ولا ينشئ نزاعاً بينه وبين المستخدم.
                                    </li>
                                    <li>
                                        يلتزم التاجر بإدارة عمليات الدفع والبيع والشراء التي تتم في متجره عبر وسائل الدفع المقرّرة في هذه الاتفاقية.
                                    </li>
                                    <li>
                                        لا يوجد أي مسؤولية أو التزام على منصة QVM في حال كان هناك عمليات بيع وشراء خارج نظامها.
                                    </li>
                                    <li>
                                        منصة QVM لها الحق في رفض أو إلغاء عمليات الشراء سواء تم الدفع أم لم يتم الدفع مع التزام منصة QVM بإبلاغ المستخدم خلال خمسة أيام بأي من طرق التواصل المتاحة لمنصة QVM.
                                    </li>
                                    <li>
                                        تنوّه منصة QVM بأنه لا علاقة لها بأي نزاع قد ينشأ بين المستخدم والتاجر، ولا علاقة لمنصة QVM بأي تقصير يحصل من المستخدم تجاه المنصة، سواءً بتخلّفه عن السداد أو غير ذلك.
                                    </li>
                                    <li>
                                        يوافق التاجر و يقر أنه لن يقوم بعمليات شراء غير حقيقية أو متلاعبة على منصة QVM، ولن يستخدم اسم غير حقيقي أو أي معلومات شخصية غير حقيقية، أو استخدام بطاقة ائتمان لا تخصه دون تفويض بالشراء، حيث أن منصة QVM لها الحق في اتخاذ الإجراءات القانونية المناسبة ضد كل من يقوم بعمليات احتيالية من هذا النوع.
                                    </li>
                                    <li>
                                        يُقر كافة التُجّار وتُقر كافة المتاجر بعلمهم التام والنافي للجهالة بأن إدارة منصة QVM في تحويلها للأموال الخاصة بأنشطتهم التجارية داخل منصة QVM تخضع لسلطة وصلاحيات مؤسسة النقد بالمملكة العربية السعودية ، ونتيجة لذلك فإن منصة QVM تُنوّه كافة المتاجر والتُجار بأنها قدّ تتأخّر في تحويل بعض الأموال وذلك نتيجة لقيود مؤسسة النقد ووزارة التجارة والاستثمار وأنظمة التجارة الإلكترونية المفروضة على عمليات البيع والشراء الإلكترونية .

                                    </li>
                                    <li>
                                        تحتفظ منصة QVM بحقها في فرض أي رسوم على التُجّار أو المتاجر نتيجة لعملياتهم داخل منصة QVM ، والرسوم قدّ تكون على سبيل المثال لا الحصر : رسوم الجهات الحكومية أو رسوم بنكية أو رسوم إدارية أو أي رسوم أخرى ، تجري مطالبة منصة QVM بدفعها نتيجة لنشاط التاجر أو المنصة.
                                    </li>
                                </ol>
          </AccordionDetails>
        </Accordion>
        <Accordion>
          <AccordionSummary
            expandIcon={<ExpandMoreIcon />}
            aria-controls="panel18a-content"
            id="panel18a-header"
          >
            <Typography className={classes.heading}>
            المادة الثامنة عشرة – محتويات غير مسموح بها :
            </Typography>
          </AccordionSummary>
          <AccordionDetails>
           <ol className={classes.orderedList}>
                                    <li>
                                        كتاجر في منصة QVM أنت تلتزم بألا تسمح بإعلان أو نشر عبر متجرك لأي محتويات تخالف سياسة الخصوصية وسرية المعلومات أو تخالف قواعد وأحكام اتفاقية الاستخدام هذه.
                                    </li>
                                </ol>
          </AccordionDetails>
        </Accordion>
        <Accordion>
          <AccordionSummary
            expandIcon={<ExpandMoreIcon />}
            aria-controls="panel19a-content"
            id="panel19a-header"
          >
            <Typography className={classes.heading}>
            المادة التاسعة عشرة – نظام الجرائم المعلوماتية السعودي :
            </Typography>
          </AccordionSummary>
          <AccordionDetails>
           <ol className={classes.orderedList}>
                                    <li>
                                        يلتزم التجار بعدم مخالفة أي من أحكام نظام الجرائم المعلوماتية السعودي، وفي حال مخالفتهم لأحكام نظام الجرائم المعلوماتية السعودي فإن هذا يخضع لمسئولتيهم المحضة ولإدارتهم، وليس هناك أي مسئولية تقع على عاتق منصة QVM من جراء مخالفة المنصة للأنظمة المرعية، حيث أن التاجر هو المسئول عن مخزونه وعن تعامله مع المستخدمين مسئولية كاملة، ولمنصة QVM دائماً الحق في اتخاذ ما تراه مناسباً عن أي مستخدم أو تاجر يخالف أحكام نظام الجرائم المعلوماتية السعودي، سواءً عن طريق ابلاغ السلطات الرسمية أو الاكتفاء بإغلاق المنصة الالكتروني أو إلغاء عضوية التاجر أو المستخدم لدى المنصة.
                                    </li>
                                </ol>
          </AccordionDetails>
        </Accordion>
        <Accordion>
          <AccordionSummary
            expandIcon={<ExpandMoreIcon />}
            aria-controls="panel20a-content"
            id="panel20a-header"
          >
            <Typography className={classes.heading}>
            المادة العشرون – تقييد الولوج أو العضوية:
            </Typography>
          </AccordionSummary>
          <AccordionDetails>
           <ol className={classes.orderedList}>
                                    <li>
                                        بدون إلحاق الضرر بحقوق التجار الأخرى، يمكن لمنصة QVM وقف أو إلغاء عضوية التاجر أو تقييد ولوج التاجر إلى خدمات المنصة في أي وقت وبدون إنذار ولأي سبب، ودون تحديد.
                                    </li>
                                </ol>
          </AccordionDetails>
        </Accordion>
        <Accordion>
          <AccordionSummary
            expandIcon={<ExpandMoreIcon />}
            aria-controls="panel21a-content"
            id="panel21a-header"
          >
            <Typography className={classes.heading}>
            المادة الحادية والعشرون – الضمان:
            </Typography>
          </AccordionSummary>
          <AccordionDetails>
           <ol className={classes.orderedList}>
                                    <li>
                                        منصة QVM لا تضمن إصلاح الأعطال ولا تضمن خلو المنتجات التي يقدّمها التجار من أي عيوب أخرى وإنما يضمنها المنصة أو التاجر في حالة ذكر الضمان ومدته وذلك بوصف المنتج.
                                    </li>
                                    <li>
                                        يلتزم المنصة بوضع سياسة الاستبدال والاسترجاع التي تخص متجره وحده، كما يجب عليه أن يلتزم بأحكام نظام التجارة الالكترونية وغير ذلك من الأنظمة المرعية التي تتعلّق بالضمان أو بالتجارة الالكترونية.
                                    </li>
                                </ol>
          </AccordionDetails>
        </Accordion>
        <Accordion>
          <AccordionSummary
            expandIcon={<ExpandMoreIcon />}
            aria-controls="panel22a-content"
            id="panel22a-header"
          >
            <Typography className={classes.heading}>
            المادة الثانية والعشرون – مسؤولية التاجر:
            </Typography>
          </AccordionSummary>
          <AccordionDetails>
           <ol className={classes.orderedList}>
                                    <li>
                                        يوافق التاجر على تحمل المسئولية ووقاية منصة QVM أو منسوبيها أو مُلّاكها أو المتفرعين عنها من أي ضرر قد يقع على منصة QVM من جراء مخالفات التاجر ، كما يلتزم برفع أي ضرر أو منع أي ضرر قد يلحق بمنصة QVM أو بمنسوبيها أو بأحدهم من جراء مطالبات أو خسائر أو أعطال أو تكاليف أو نفقات أو رسوم نتجت بسبب إساءة استخدام التاجر أو سوء استخدام المستخدم ونتج عن ذلك خرق لاتفاقية الاستخدام أو الأنظمة والقوانين المرعية بالمملكة العربية السعودية أو تعدي على حقوق أحد التجار أو أطراف ثالثة أو شكوى من أحد المستخدمين أو أطراف ثالثة.
                                    </li>
                                </ol>
          </AccordionDetails>
        </Accordion>
        

        
        <Accordion>
          <AccordionSummary
            expandIcon={<ExpandMoreIcon />}
            aria-controls="panel23a-content"
            id="panel23a-header"
          >
            <Typography className={classes.heading}>
            المادة الثالثة والعشرون – العلاقة والإشعارات بين منصة QVM والتجار:
            </Typography>
          </AccordionSummary>
          <AccordionDetails>
           <ol className={classes.orderedList}>
                                    <li>
                                        لا تتضمن أي من قواعد وأحكام اتفاقية الاستخدام هذه إشارة إلى وجود شراكة بين أي تاجر ومنصة QVM ، ولا تسمح منصة QVM لأي تاجر في أي حال من الأحوال بالإشارة المباشرة أو الغير مباشرة أو الإملاء إلى وجود علاقة أي كان نوعها سواء كانت مباشرة أو غير مباشرة بينه كتاجر وبين منصة QVM أو إدارتها ، وأن أي إشعارات يرغب التاجر في إرسالها إلى منصة QVM ، عليه أن يقوم بإرسالها عبر البريد الإلكتروني وتقوم منصة QVM بالرد على الرسالة الإلكترونية. وأنت كتاجر توافق على أن أي إشعارات ترسل إليك من منصة QVM سوف تُسلّم إليك بواسطة البريد الإلكتروني الذي قمت بتزويد منصة QVM به خلال عملية التسجيل.
                                    </li>
                                </ol>
          </AccordionDetails>
        </Accordion>
        <Accordion>
          <AccordionSummary
            expandIcon={<ExpandMoreIcon />}
            aria-controls="panel24a-content"
            id="panel24a-header"
          >
            <Typography className={classes.heading}>
            المادة الرابعة والعشرون – نقل الحقوق والالتزامات:
            </Typography>
          </AccordionSummary>
          <AccordionDetails>
           <ol className={classes.orderedList}>
                                    <li>
                                        أنت كتاجر لا تملك الحق في الاعتراض على تصرفات إدارة منصة QVM حيال منصة QVM سواء كانت هذه التصرفات على سبيل المثال لا الحصر : تمس كيان منصة QVM أو التزاماتها أو ملكيتها أو مسئولياتها أو تصرفات تقنية أو تصرفات إدارية تتعلّق بمنصة QVM ، وليست مُلزَمة منصة QVM بإبلاغك ، و لمنصة QVM إن رأت أهمية إبلاغك عن أي من هذه التصرفات أن تقوم بإبلاغك وفقاً لإرادتها المحضة ، وذلك بحسب قواعد وأحكام اتفاقية الاستخدام.
                                    </li>
                                </ol>
          </AccordionDetails>
        </Accordion>
        <Accordion>
          <AccordionSummary
            expandIcon={<ExpandMoreIcon />}
            aria-controls="panel25a-content"
            id="panel25a-header"
          >
            <Typography className={classes.heading}>
            المادة الخامسة والعشرون – القانون والتشريع المُطبّق:
            </Typography>
          </AccordionSummary>
          <AccordionDetails>
           <ol className={classes.orderedList}>
                                    <li>
                                        اتفاقية الاستخدام هذه محكومة ومصاغة بحسب القوانين والأنظمة والتشريعات المعمول بها والسارية في المملكة العربية السعودية ، وهي خاضعة تمامًا وكليًا للتشريع المعمول به لدى السلطات في المملكة العربية السعودية.
                                    </li>
                                </ol>
          </AccordionDetails>
        </Accordion>
        <Accordion>
          <AccordionSummary
            expandIcon={<ExpandMoreIcon />}
            aria-controls="panel26a-content"
            id="panel26a-header"
          >
            <Typography className={classes.heading}>
            ​المادة السادسة والعشرون – قواعد يجب على المنصة اتباعها عند التعامل مع المستخدم :
            </Typography>
          </AccordionSummary>
          <AccordionDetails>
           <ol className={classes.orderedList}>
                                    <li>
                                        يلتزم التاجر عند تعامله مع المستخدم أن يلتزم بالصدق والأمانة والنزاهة.
                                    </li>
                                    <li>
                                        يلتزم التاجر عند تعامله مع المستخدم أن يلتزم بحُسن الأخلاق.
                                    </li>
                                </ol>
          </AccordionDetails>
        </Accordion>
        <Accordion>
          <AccordionSummary
            expandIcon={<ExpandMoreIcon />}
            aria-controls="panel27a-content"
            id="panel27a-header"
          >
            <Typography className={classes.heading}>
            المادة السابعة والعشرون – المنشورات الدعائية الورقية والإلكترونية والعروض الخاصة بمنصة QVM:
            </Typography>
          </AccordionSummary>
          <AccordionDetails>
           <ol className={classes.orderedList}>
                                    <li>
                                        تسري قواعد وأحكام اتفاقية الاستخدام هذه على كافة المنشورات الدعائية الورقية والإلكترونية عبر مختلف منصات النشر وعبر مختلف وسائل التواصل الاجتماعي.
                                    </li>
                                    <li>
                                        المنشورات والمطبوعات المذكورة هي وسيلة ترويجية لمنصة QVM.
                                    </li>
                                    <li>
                                        إن المنشورات قابلة للتغيير وهي غير ملزمة لمنصة QVM فيما يخص ثبات أسعار الخدمات أو الباقات أو العروض وتغيير الأسعار يخضع للمتغيرات التي تطرأ على منصة QVM أو المتاجر أو التجار.
                                    </li>
                                    <li>
                                        إن أي عروض تضعها منصة QVM هي عبارة عن عروض مؤقتة ويتم تحديدها بفترة زمنية محددة ، ولا تلتزم منصة QVM بتمديد الفترة الزمنية أو بالاستمرار في الفترة الزمنية المحددة حيث أنها تملك الحق في الاكتفاء أو تحديد استحقاق أي مستخدم لهذا العرض أو إلغاء هذا العرض في أي وقت.
                                    </li>
                                </ol>
          </AccordionDetails>
        </Accordion>
        <Accordion>
          <AccordionSummary
            expandIcon={<ExpandMoreIcon />}
            aria-controls="panel2a-content"
            id="panel2a-header"
          >
            <Typography className={classes.heading}>
            المادة الثامنة والعشرون – الخدمات الإستراتيجية واللوجستية ( خدمات الطرف الثالث ) :
            </Typography>
          </AccordionSummary>
          <AccordionDetails>
           <ol className={classes.orderedList}>
                                    <li>
                                        بموجب قواعد وأحكام اتفاقية الاستخدام هذه فإن منصة QVM قدّ توفّر بعض الخدمات الإستراتيجية أو اللوجستية عن طريق طرف ثالث أو أطراف ثالثة ، وقدّ تكون هذه الخدمات على سبيل المثال لا الحصر : خدمات شركات الشحن وتوصيل المنتجات والبضائع.
                                    </li>
                                    <li>
                                        تحيطكم منصة QVM علمًا بأن توفيرها للخدمات الإستراتيجية أو اللوجستية ليس إلا تسهيلًا وتعاونًا منها ولمساعدة مستخدمين منصة QVM.
                                    </li>
                                    <li>
                                        تحيطكم علمًا منصة QVM بأنها غير مسئولة تمامًا بشكل مباشر أو غير مباشر عن أي تصرفات تصدُر من أي طرف ثالث وأن ما تقوم به هو مجرد ربط بين المستخدم ومُقدِم الخدمة ( الطرف الثالث ) .
                                    </li>
                                    <li>
                                        تحيطكم علمًا منصة QVM بأن طلب هذه الخدمة غير إلزامي وإنما يعود هذا الأمر إلى رغبة وحاجة المستخدم، وعند استخدام التاجر لخدمات الطرف الثالث المتوفّر لدى منصة QVM فإن منصة QVM تخلي مسئوليتها عن هذه العلاقة وتكون لهذه العلاقة أحكامها المستقلة التي تتم بين التاجر وبين الطرف الثالث.
                                    </li>
                                    <li>
                                        إن بعض مقدمين الخدمات الإستراتيجية واللوجستية يضعون اشتراطات خاصة بهم أو تكاليف خاصة بهم ولا تملك منصة QVM أي سلطة على هذه الاشتراطات أو هذه التكاليف ، ولذلك تنصح منصة QVM التجّار المسجّلين لديها إلى الاطلاع على شروط مقدم الخدمة ( الطرف الثالث ) وتكاليف خدماته قبل تأكيد طلب الخدمة.
                                    </li>
                                    <li>
                                        في حال تقدّم المستخدم بطلب خدمة مقدّمة عن طريق ( طرف ثالث ) فإن المستخدم بهذا التصرّف يصرّح لمنصة QVM ويمنحها الإذن بتزويد مقدم الخدمة ( الطرف الثالث ) ببيانات المستخدم الشخصية التي يطلبها ، وغير ذلك من البيانات التي يحتاجها مقدّم الخدمة ( الطرف الثالث ) ، ويكون ذلك وفقاً لقواعد وأحكام سياسة الخصوصية وسرية المعلومات المعمول بها لدى منصّة QVM.
                                    </li>
                                </ol>
          </AccordionDetails>
        </Accordion>
        <Accordion>
          <AccordionSummary
            expandIcon={<ExpandMoreIcon />}
            aria-controls="panel28a-content"
            id="panel28a-header"
          >
            <Typography className={classes.heading}>
            المادة التاسعة والعشرون – الدعم الفني:
            </Typography>
          </AccordionSummary>
          <AccordionDetails>
                <Typography sx={{mb:2}}>
                بموجب قواعد وأحكام اتفاقية الاستخدام هذه فإن منصة QVM توفّر بعض خدمات الدعم الفني للمتاجر والتُجّار ، ويكون ذلك وفقاً لامتيازات الباقة التي يشترك فيها المنصة ، وتكون على سبيل المثال
                </Typography>
                 <ol className={classes.orderedList}>
                                    <li>
                                        لوحة تحكم مجانية للتجار ، وتتضمّن لوحة التحكم بعض الخدمات المجانية.
                                    </li>
                                    <li>
                                        في حال رغب التاجر بإضافة بعض الخدمات أو بخدمات مختلفة أو بخدمات متعددة فإن ذلك يخضع لسياسة باقات وعروض منصة QVM والتي غالبًا ما تخضع لرسوم مالية.
                                    </li>
                                    <li>
                                        تتيح منصة QVM للمتاجر حق التواصل مع فريق الدعم الفني لمنصة QVM بما يساعد عمل المتاجر عبر المنصة وحل المسائل الفنية الالكترونية التي قد تطرأ على المتاجر.
                                    </li>
                                </ol>
          </AccordionDetails>
        </Accordion>
        <Accordion>
          <AccordionSummary
            expandIcon={<ExpandMoreIcon />}
            aria-controls="panel29a-content"
            id="panel29a-header"
          >
            <Typography className={classes.heading}>
            المادة الثلاثون – حل الخلافات:
            </Typography>
          </AccordionSummary>
          <AccordionDetails>
           <ol className={classes.orderedList}>
                                    <li>
                                        بموجب قواعد وأحكام اتفاقية الاستخدام هذه فإنه في حال النزاع لا سمح الله فيتم حل الخلاف عن طريق التوفيق والمفاوضات أو التسوية الودية، وفي حال استمرار الخلاف فيتم حله عن طريق السلطات المختصة بالمملكة العربية السعودية.
                                    </li>
                                </ol>
          </AccordionDetails>
        </Accordion>
        <Accordion>
          <AccordionSummary
            expandIcon={<ExpandMoreIcon />}
            aria-controls="panel30a-content"
            id="panel30a-header"
          >
            <Typography className={classes.heading}>
            المادة الحادية والثلاثون – أحكام عامة:
            </Typography>
          </AccordionSummary>
          <AccordionDetails>
           <ol className={classes.orderedList}>
                                    <li>
                                        في حال إلغاء أي مادة واردة أو بند ورد في اتفاقية الاستخدام هذه أو أن هناك أي مادة واردة أو أي بند وارد في اتفاقية الاستخدام لم يعد نافذًا، فإن مثل هذا الأمر لا يلغي صلاحية باقي المواد والبنود والقواعد والأحكام الواردة في اتفاقية الاستخدام وتظل سارية حتى إشعار آخر من إدارة منصة QVM.
                                    </li>
                                    <li>
                                        اتفاقية الاستخدام هذه – والتي تعدل بين حين وآخر بحسب مقتضى الحال – تُشكّل آلية العمل والتفاهم والاتفاق والتعاقد بين التاجر ومتجره ومنصة QVM فقط لا غير ، ويلتزم التاجر و المنصة بالالتزام بأحكام هذه الاتفاقية، كما يوافق التاجر على أن يوضع في عين الاعتبار ما يلي:
                                        <ul className={classes.list}>
                                            <li>
                                                اتفاقية الاستخدام هذه سارية على كافة المستخدمين لمنصة QVM وهي المُنظّمة للعلاقة وهي العقد فيما بين التاجر و منصة QVM فقط لا غير، بغض النظر عن أي شكل نظامي أو كيان قانوني أو مؤسسي أو تجاري أو خيري يتخذه التاجر أو المنصة. أما فيما يخص العلاقة فيما بين التاجر والمستخدم فإنه تخضع لعلاقة قانونية مستقلة ولها ضوابطها الخاصة الجارية فيما بينهم.
                                            </li>
                                            <li>
                                                يجب على المنصة أن يضع اتفاقية استخدام خاصة به ، على أن تكون وفقاً لأحكام الأنظمة والقوانين المعمول بها لدى المملكة العربية السعودية ، وعلى وجه الخصوص نظام التعاملات الالكترونية ونظام التجارة الالكترونية وغير ذلك من الأنظمة التي تتعلّق بنشاط التاجر.
                                            </li>
                                            <li>
                                                ليس من حق أي شخص – عدا إدارة منصة QVM – فرض أي مواد أو بنود أو أحكام في اتفاقية الاستخدام الخاصة بمنصة QVM، ولمنصة QVM استقبال اقتراحات التجار فيما يتعلّق بهذه الاتفاقية.
                                            </li>
                                            <li>
                                                إذا تمت ترجمة اتفاقية الاستخدام لأي لغة أخرى ، سواء على منصة QVM أو خلافها ، فإن النص العربي لاتفاقية الاستخدام يظل هو الأصل في كافة التعاملات.
                                            </li>
                                            <li>
                                                لا تُلغى أو تُعدل اتفاقية الاستخدام هذه إلا بموجب قرار يصدر من إدارة منصة QVM.
                                            </li>
                                        </ul>
                                    </li>
                                </ol>
          </AccordionDetails>
        </Accordion>
        
        </Box>
      </Container>
    </Page>
  );
}

export default RegisterForm;
